AdrianoRuseler/LAUNCHXL-F28379D/C2000Ware/common/deprecated/inc/hw_adc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1STAMP register
//
//*****************************************************************************
#define ADC_PPB1STAMP_DLYSTAMP_S  0
#define ADC_PPB1STAMP_DLYSTAMP_M  0xFFF       // ADC Post Processing Block Delay
                                              // Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1OFFCAL register
//
//*****************************************************************************
#define ADC_PPB1OFFCAL_OFFCAL_S   0
#define ADC_PPB1OFFCAL_OFFCAL_M   0x3FF       // ADC Post Processing Block
                                              // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1OFFREF register
//
//*****************************************************************************
#define ADC_PPB1OFFREF_OFFREF_S   0
#define ADC_PPB1OFFREF_OFFREF_M   0xFFFF      // ADC Post Processing Block
                                              // Offset Reference

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPHI register
//
//*****************************************************************************
#define ADC_PPB1TRIPHI_LIMITHI_S  0
#define ADC_PPB1TRIPHI_LIMITHI_M  0xFFFF      // ADC Post Processing Block Trip
                                              // High Limit
#define ADC_PPB1TRIPHI_HSIGN      0x10000     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPLO register
//
//*****************************************************************************
#define ADC_PPB1TRIPLO_LIMITLO_S  0
#define ADC_PPB1TRIPLO_LIMITLO_M  0xFFFF      // ADC Post Processing Block Trip
                                              // Low Limit
#define ADC_PPB1TRIPLO_LSIGN      0x10000     // Low Limit Sign Bit
#define ADC_PPB1TRIPLO_REQSTAMP_S  20
#define ADC_PPB1TRIPLO_REQSTAMP_M  0xFFF00000  // ADC Post Processing Block
                                              // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2CONFIG register
//
//*****************************************************************************
#define ADC_PPB2CONFIG_CONFIG_S   0
#define ADC_PPB2CONFIG_CONFIG_M   0xF         // ADC Post Processing Block
                                              // Configuration
#define ADC_PPB2CONFIG_TWOSCOMPEN  0x10        // ADC Post Processing Block Two's
                                              // Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2STAMP register
//
//*****************************************************************************
#define ADC_PPB2STAMP_DLYSTAMP_S  0
#define ADC_PPB2STAMP_DLYSTAMP_M  0xFFF       // ADC Post Processing Block Delay
                                              // Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2OFFCAL register
//
//*****************************************************************************
#define ADC_PPB2OFFCAL_OFFCAL_S   0
#define ADC_PPB2OFFCAL_OFFCAL_M   0x3FF       // ADC Post Processing Block
                                              // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2OFFREF register
//
//*****************************************************************************
#define ADC_PPB2OFFREF_OFFREF_S   0
#define ADC_PPB2OFFREF_OFFREF_M   0xFFFF      // ADC Post Processing Block
                                              // Offset Reference

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2TRIPHI register
//
//*****************************************************************************
#define ADC_PPB2TRIPHI_LIMITHI_S  0
#define ADC_PPB2TRIPHI_LIMITHI_M  0xFFFF      // ADC Post Processing Block Trip
                                              // High Limit
#define ADC_PPB2TRIPHI_HSIGN      0x10000     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2TRIPLO register
//
//*****************************************************************************
#define ADC_PPB2TRIPLO_LIMITLO_S  0
#define ADC_PPB2TRIPLO_LIMITLO_M  0xFFFF      // ADC Post Processing Block Trip
                                              // Low Limit
#define ADC_PPB2TRIPLO_LSIGN      0x10000     // Low Limit Sign Bit
#define ADC_PPB2TRIPLO_REQSTAMP_S  20
#define ADC_PPB2TRIPLO_REQSTAMP_M  0xFFF00000  // ADC Post Processing Block
                                              // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3CONFIG register
//
//*****************************************************************************
#define ADC_PPB3CONFIG_CONFIG_S   0
#define ADC_PPB3CONFIG_CONFIG_M   0xF         // ADC Post Processing Block
                                              // Configuration
#define ADC_PPB3CONFIG_TWOSCOMPEN  0x10        // ADC Post Processing Block Two's
                                              // Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3STAMP register
//
//*****************************************************************************
#define ADC_PPB3STAMP_DLYSTAMP_S  0
#define ADC_PPB3STAMP_DLYSTAMP_M  0xFFF       // ADC Post Processing Block Delay
                                              // Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3OFFCAL register
//
//*****************************************************************************
#define ADC_PPB3OFFCAL_OFFCAL_S   0
#define ADC_PPB3OFFCAL_OFFCAL_M   0x3FF       // ADC Post Processing Block
                                              // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3OFFREF register
//
//*****************************************************************************
#define ADC_PPB3OFFREF_OFFREF_S   0
#define ADC_PPB3OFFREF_OFFREF_M   0xFFFF      // ADC Post Processing Block
                                              // Offset Reference

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3TRIPHI register
//
//*****************************************************************************
#define ADC_PPB3TRIPHI_LIMITHI_S  0
#define ADC_PPB3TRIPHI_LIMITHI_M  0xFFFF      // ADC Post Processing Block Trip
                                              // High Limit
#define ADC_PPB3TRIPHI_HSIGN      0x10000     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3TRIPLO register
//
//*****************************************************************************
#define ADC_PPB3TRIPLO_LIMITLO_S  0
#define ADC_PPB3TRIPLO_LIMITLO_M  0xFFFF      // ADC Post Processing Block Trip
                                              // Low Limit
#define ADC_PPB3TRIPLO_LSIGN      0x10000     // Low Limit Sign Bit
#define ADC_PPB3TRIPLO_REQSTAMP_S  20
#define ADC_PPB3TRIPLO_REQSTAMP_M  0xFFF00000  // ADC Post Processing Block
                                              // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4CONFIG register
//
//*****************************************************************************
#define ADC_PPB4CONFIG_CONFIG_S   0
#define ADC_PPB4CONFIG_CONFIG_M   0xF         // ADC Post Processing Block
                                              // Configuration
#define ADC_PPB4CONFIG_TWOSCOMPEN  0x10        // ADC Post Processing Block Two's
                                              // Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4STAMP register
//
//*****************************************************************************
#define ADC_PPB4STAMP_DLYSTAMP_S  0
#define ADC_PPB4STAMP_DLYSTAMP_M  0xFFF       // ADC Post Processing Block Delay
                                              // Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4OFFCAL register
//
//*****************************************************************************
#define ADC_PPB4OFFCAL_OFFCAL_S   0
#define ADC_PPB4OFFCAL_OFFCAL_M   0x3FF       // ADC Post Processing Block
                                              // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4OFFREF register
//
//*****************************************************************************
#define ADC_PPB4OFFREF_OFFREF_S   0
#define ADC_PPB4OFFREF_OFFREF_M   0xFFFF      // ADC Post Processing Block
                                              // Offset Reference

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4TRIPHI register
//
//*****************************************************************************
#define ADC_PPB4TRIPHI_LIMITHI_S  0
#define ADC_PPB4TRIPHI_LIMITHI_M  0xFFFF      // ADC Post Processing Block Trip
                                              // High Limit
#define ADC_PPB4TRIPHI_HSIGN      0x10000     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4TRIPLO register
//
//*****************************************************************************
#define ADC_PPB4TRIPLO_LIMITLO_S  0
#define ADC_PPB4TRIPLO_LIMITLO_M  0xFFFF      // ADC Post Processing Block Trip
                                              // Low Limit
#define ADC_PPB4TRIPLO_LSIGN      0x10000     // Low Limit Sign Bit
#define ADC_PPB4TRIPLO_REQSTAMP_S  20
#define ADC_PPB4TRIPLO_REQSTAMP_M  0xFFF00000  // ADC Post Processing Block
                                              // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT0 register
//
//*****************************************************************************
#define ADC_RESULT0_RESULT_S      0
#define ADC_RESULT0_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT1 register
//
//*****************************************************************************
#define ADC_RESULT1_RESULT_S      0
#define ADC_RESULT1_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT2 register
//
//*****************************************************************************
#define ADC_RESULT2_RESULT_S      0
#define ADC_RESULT2_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT3 register
//
//*****************************************************************************
#define ADC_RESULT3_RESULT_S      0
#define ADC_RESULT3_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT4 register
//
//*****************************************************************************
#define ADC_RESULT4_RESULT_S      0
#define ADC_RESULT4_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT5 register
//
//*****************************************************************************
#define ADC_RESULT5_RESULT_S      0
#define ADC_RESULT5_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT6 register
//
//*****************************************************************************
#define ADC_RESULT6_RESULT_S      0
#define ADC_RESULT6_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT7 register
//
//*****************************************************************************
#define ADC_RESULT7_RESULT_S      0
#define ADC_RESULT7_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT8 register
//
//*****************************************************************************
#define ADC_RESULT8_RESULT_S      0
#define ADC_RESULT8_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT9 register
//
//*****************************************************************************
#define ADC_RESULT9_RESULT_S      0
#define ADC_RESULT9_RESULT_M      0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT10 register
//
//*****************************************************************************
#define ADC_RESULT10_RESULT_S     0
#define ADC_RESULT10_RESULT_M     0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT11 register
//
//*****************************************************************************
#define ADC_RESULT11_RESULT_S     0
#define ADC_RESULT11_RESULT_M     0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT12 register
//
//*****************************************************************************
#define ADC_RESULT12_RESULT_S     0
#define ADC_RESULT12_RESULT_M     0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT13 register
//
//*****************************************************************************
#define ADC_RESULT13_RESULT_S     0
#define ADC_RESULT13_RESULT_M     0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT14 register
//
//*****************************************************************************
#define ADC_RESULT14_RESULT_S     0
#define ADC_RESULT14_RESULT_M     0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCRESULT15 register
//
//*****************************************************************************
#define ADC_RESULT15_RESULT_S     0
#define ADC_RESULT15_RESULT_M     0xFFFF      // ADC Result

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1RESULT register
//
//*****************************************************************************
#define ADC_PPB1RESULT_PPBRESULT_S  0
#define ADC_PPB1RESULT_PPBRESULT_M  0xFFFF      // ADC Post Processing Block
                                              // Result
#define ADC_PPB1RESULT_SIGN_S     16
#define ADC_PPB1RESULT_SIGN_M     0xFFFF0000  // Sign Extended Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2RESULT register
//
//*****************************************************************************
#define ADC_PPB2RESULT_PPBRESULT_S  0
#define ADC_PPB2RESULT_PPBRESULT_M  0xFFFF      // ADC Post Processing Block
                                              // Result
#define ADC_PPB2RESULT_SIGN_S     16
#define ADC_PPB2RESULT_SIGN_M     0xFFFF0000  // Sign Extended Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3RESULT register
//
//*****************************************************************************
#define ADC_PPB3RESULT_PPBRESULT_S  0
#define ADC_PPB3RESULT_PPBRESULT_M  0xFFFF      // ADC Post Processing Block
                                              // Result
#define ADC_PPB3RESULT_SIGN_S     16
#define ADC_PPB3RESULT_SIGN_M     0xFFFF0000  // Sign Extended Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4RESULT register
//
//*****************************************************************************
#define ADC_PPB4RESULT_PPBRESULT_S  0
#define ADC_PPB4RESULT_PPBRESULT_M  0xFFFF      // ADC Post Processing Block
                                              // Result
#define ADC_PPB4RESULT_SIGN_S     16
#define ADC_PPB4RESULT_SIGN_M     0xFFFF0000  // Sign Extended Bits
#endif
